export const video = [{
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}]

export const book = [{
  name: '',  // 书名
  source: '',  // 资源地址
  cover: '',  // 封面
  score: '',  // 评分
  details: {
    author: [],  // 作者
    producer: [],  // 出品方
    publisher: [],  // 出版社
    translator: [],  // 译者
    subTitle: '',  // 副标题
    date: '',  // 出版日期
    pageNumber: 0, // 页数
    price: 0,  // 定价
    binding: '',  // 装帧
    series: '',  // 丛书
    ISBN: '',  // 编号
  }
}]

export const music = [{
  name: '',  // 歌名
  source: '',  // 播放源
  lyrics: '',  // 歌词
  cover: '',  // 封面
  score: '',  // 评分
  details: {
    singer: [],  // 歌手
    date: '',  // 日期
  }
}]

export const image = [{
  name: '',  // 图片名
  source: '',  // 资源地址
  score: '',  // 评分
  details: {
    author: [],  // 作者
    date: '',  // 日期
  }
}]