export const video = [{
  name: '一九四二',  // 片名
  source: "https://cdn.zoubuting.com/20221130/3IIvCUnL/1000kb/hls/index.m3u8",  // 播放源
  cover: 'https://www.nunuyy5.org/img/22752.jpg',  // 封面
  score: '81',  // 评分
  details: {
    alias: ['温故1942', '1942', '温故一九四二', 'Back to 1942'],  // 别名
    directors: ['冯小刚'],  // 导演
    scriptwriter: ['刘震云'],  // 编剧
    actors: ['张国立', '张默', '徐帆', '李雪健', '陈道明', '艾德里安·布洛迪', '蒂姆·罗宾斯', '冯远征', '张涵予', '王子文', '段奕宏', '范伟', '柯蓝', '张国强', '林永健', '乔振宇', '李倩', '赵毅'],  // 演员
    types: ['剧情', '历史', '战争', '灾难'],  // 类型
    region: '中国大陆',  // 地区
    language: ['河南方言', '英语', '日语', '汉语普通话'],  // 语言
    date: '2012-11-29',  // 上映日期
    duration: '146分钟',  // 片长
    IMDB: 'tt2113822',  // 编号
    intro: '1942年，抗日战争与第二次世界大战正处于白热化阶段。燎原之火，生灵涂炭，天灾人祸，哀鸿遍野。当军事家和政治家的目光聚焦在一城一郭的征伐劫掠之时，几乎鲜少有人注意到古老的中原河南正爆发一场惨绝人寰的大旱灾。影片的主角老东家（张国立 饰），狡猾、市侩，典型的封建地主，可即便如此也无法对抗这史无前例的灾难，他被迫逃荒，亲眼见证着儿子、儿媳、老伴等亲人的种种死状。他的遭遇是三百万灾民的缩影，面对这群人的苦难，无论是高高在上的蒋委员长（陈道明 饰），还是深入民间报道灾难真相的美国记者白修德（阿德里安•布劳迪 Adrien Brody 饰），以及海内外的每一个人，如何能从这眼前的人间炼狱之景侧目。绝望无止的逃生坎途，中华民族多舛命运的苦难一斑……本片根据刘震云的小说《温故一九四二》改编。',  // 剧情简介
  }
}, {
  name: '活着',  // 片名
  source: "https://vip.lzcdn2.com/20220407/2614_9730c040/1200k/hls/mixed.m3u8",  // 播放源
  cover: 'https://www.nunuyy5.org/img/10359.jpg',  // 封面
  score: '93',  // 评分
  details: {
    alias: ['人生', 'Lifetimes', 'To Live'],  // 别名
    directors: ['张艺谋'],  // 导演
    scriptwriter: ['芦苇', '余华'],  // 编剧
    actors: ['葛优', '巩俐', '姜武', '牛犇', '郭涛', '张璐', '倪大红', '肖聪', '董飞', '刘天池', '董立范', '黄宗洛', '刘燕瑾', '李连义', '杨同顺'],  // 演员
    types: ['剧情', '家庭', '历史'],  // 类型
    region: '中国大陆 / 中国香港',  // 地区
    language: ['汉语普通话'],  // 语言
    date: '1994-06-30',  // 上映日期
    duration: '132分钟',  // 片长
    IMDB: 'tt0110081',  // 编号
    intro: '根据余华同名小说改编。富少福贵（葛优）嗜赌成性，妻子家珍（巩俐）屡劝无果后带着女儿凤霞离开了他，当夜，福贵输光所有家产气死父亲，被迫靠变卖母亲首饰租间破屋过活。一年后，家珍手拉凤霞怀抱刚出世的儿子有庆回到家中，福贵痛改前非，开始靠演皮影戏过起安份守己的日子。但好景不常，内战时期，福贵被国民党抓去当劳工，一番辗转终回到家乡与一家人团圆后，凤霞因病变成哑巴，而在后来的大跃进运动和文化大革命中，他虽获某些小福，逆境却也一直与他如影相随。',  // 剧情简介
  }
}, {
  name: '盗梦空间 Inception',  // 片名
  source: 'https://vip.lzcdn2.com/20220318/5_1dddc8ed/1200k/hls/mixed.m3u8',  // 播放源
  cover: 'https://www.nunuyy5.org/img/7234.jpg',  // 封面
  score: '94',  // 评分
  details: {
    alias: ['潜行凶间(港)', '全面启动(台)', '奠基', '心灵犯案', '记忆迷阵', '记忆魔方'],  // 别名
    directors: ['克里斯托弗·诺兰'],  // 导演
    scriptwriter: ['克里斯托弗·诺兰'],  // 编剧
    actors: ['莱昂纳多·迪卡普里奥', '约瑟夫·高登-莱维特', '艾利奥特·佩吉', '汤姆·哈迪', '渡边谦', '迪利普·劳', '基里安·墨菲', '汤姆·贝伦杰', '玛丽昂·歌迪亚', '皮特·波斯尔思韦特', '迈克尔·凯恩', '卢卡斯·哈斯', '李太力', '克莱尔·吉尔蕾', '马格努斯·诺兰', '泰勒·吉蕾', '乔纳森·吉尔', '水源士郎', '冈本玉二', '厄尔·卡梅伦', '瑞恩·海沃德', '米兰达·诺兰', '拉什·费加', '蒂姆·科勒赫', '妲露拉·莱莉'],  // 演员
    types: ['剧情', '科幻', '悬疑', '冒险'],  // 类型
    region: '美国 / 英国',  // 地区
    language: ['英语', '日语', '法语'],  // 语言
    date: '2010-09-01',  // 上映日期
    duration: '148分钟',  // 片长
    IMDB: 'tt1375666',  // 编号
    intro: '道姆·柯布（莱昂纳多·迪卡普里奥 Leonardo DiCaprio 饰）与同事阿瑟（约瑟夫·戈登-莱维特 Joseph Gordon-Levitt 饰）和纳什（卢卡斯·哈斯 Lukas Haas 饰）在一次针对日本能源大亨齐藤（渡边谦 饰）的盗梦行动中失败，反被齐藤利用。齐藤威逼利诱因遭通缉而流亡海外的柯布帮他拆分他竞争对手的公司，采取极端措施在其唯一继承人罗伯特·费希尔（希里安·墨菲 Cillian Murphy 饰）的深层潜意识中种下放弃家族公司、自立门户的想法。为了重返美国，柯布偷偷求助于岳父迈尔斯（迈克尔·凯恩 Michael Caine 饰），吸收了年轻的梦境设计师艾里阿德妮（艾伦·佩吉 Ellen Page 饰）、梦境演员艾姆斯（汤姆·哈迪 Tom Hardy 饰）和药剂师约瑟夫（迪利普·劳 Dileep Rao 饰）加入行动。在一层层递进的梦境中，柯布不仅要对付费希尔潜意识的本能反抗，还必须直面已逝妻子梅尔（玛丽昂·歌迪亚 Marion Cotillard 饰）的处处破坏，实际情况远比预想危险得多……',  // 剧情简介
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}, {
  name: '狼群',  // 片名
  source: '',  // 播放源
  cover: 'https://pic.rmb.bdstatic.com/bjh/4092b755ca751ae195a4f6635a041843.jpeg',  // 封面
  score: '55',  // 评分
  details: {
    directors: ['蒋丛'],  // 导演
    actors: ['张晋', '李治廷', '蒋璐霞', '刘智满', '叶浏', '张衣', '唐国忠', '高冬平', '薛佳凝'],  // 演员
    types: ['动作', '战争'],  // 类型
    region: '中国大陆',  // 地区
    alias: ['我的佣兵生涯', '佣兵', 'Wolf Pack'],  // 别名
    intro: '境外恐怖势力掀起能源危机，7名反恐精英秘密守护“地下长城”！老刁（张晋 饰）率领的“狼群小队”长期从事境外安保工作，某次执行任务的过程中，意外发现境外恐怖势力将黑手伸向中国能源命脉！老刁临危受命，率领柯童（李治廷 饰）、妖怪（蒋璐霞 饰）等队员雷霆出击。危机迫在眉睫，“狼群小队”能否化险为夷？',  // 剧情简介
    scriptwriter: ['蒋丛'],  // 编剧
    date: '2022-09-09',  // 上映日期
    duration: '105分钟',  // 片长
    language: ['汉语普通话', '英语'],  // 语言
    IMDB: 'tt11771642',  // 编号
  }
}]

export const book = [{
  name: '',  // 书名
  source: '',  // 资源地址
  cover: '',  // 封面
  score: '',  // 评分
  details: {
    author: [],  // 作者
    producer: [],  // 出品方
    publisher: [],  // 出版社
    translator: [],  // 译者
    subTitle: '',  // 副标题
    date: '',  // 出版日期
    pageNumber: 0, // 页数
    price: 0,  // 定价
    binding: '',  // 装帧
    series: '',  // 丛书
    ISBN: '',  // 编号
  }
}]

export const music = [{
  name: '',  // 歌名
  source: '',  // 播放源
  lyrics: '',  // 歌词
  cover: '',  // 封面
  score: '',  // 评分
  details: {
    singer: [],  // 歌手
    date: '',  // 日期
  }
}]

export const image = [{
  name: '',  // 图片名
  source: '',  // 资源地址
  score: '',  // 评分
  details: {
    author: [],  // 作者
    date: '',  // 日期
  }
}]