export const category = [
  { title: "视频", path: "video" },
  { title: "电子书", path: "ebook" },
  { title: "音乐", path: "music" },
  { title: "图片", path: "picture" },
  { title: "文章", path: "article" },
  { title: "RSS", path: "rss" },
];

// 测试github actions7
export const video = [
  {
    name: "一九四二", // 片名
    source: "https://cdn.zoubuting.com/20221130/3IIvCUnL/1000kb/hls/index.m3u8", // 播放源
    cover: "/covers/1942.jpeg", // 封面
    score: "81", // 评分
    details: {
      alias: ["温故1942", "1942", "温故一九四二", "Back to 1942"], // 别名
      directors: ["冯小刚"], // 导演
      scriptwriter: ["刘震云"], // 编剧
      actors: [
        "张国立",
        "张默",
        "徐帆",
        "李雪健",
        "陈道明",
        "艾德里安·布洛迪",
        "蒂姆·罗宾斯",
        "冯远征",
        "张涵予",
        "王子文",
        "段奕宏",
        "范伟",
        "柯蓝",
        "张国强",
        "林永健",
        "乔振宇",
        "李倩",
        "赵毅",
      ], // 演员
      types: ["剧情", "历史", "战争", "灾难"], // 类型
      region: "中国大陆", // 地区
      language: ["河南方言", "英语", "日语", "汉语普通话"], // 语言
      date: "2012-11-29", // 上映日期
      duration: "146分钟", // 片长
      IMDB: "tt2113822", // 编号
      intro:
        "1942年，抗日战争与第二次世界大战正处于白热化阶段。燎原之火，生灵涂炭，天灾人祸，哀鸿遍野。当军事家和政治家的目光聚焦在一城一郭的征伐劫掠之时，几乎鲜少有人注意到古老的中原河南正爆发一场惨绝人寰的大旱灾。影片的主角老东家（张国立 饰），狡猾、市侩，典型的封建地主，可即便如此也无法对抗这史无前例的灾难，他被迫逃荒，亲眼见证着儿子、儿媳、老伴等亲人的种种死状。他的遭遇是三百万灾民的缩影，面对这群人的苦难，无论是高高在上的蒋委员长（陈道明 饰），还是深入民间报道灾难真相的美国记者白修德（阿德里安•布劳迪 Adrien Brody 饰），以及海内外的每一个人，如何能从这眼前的人间炼狱之景侧目。绝望无止的逃生坎途，中华民族多舛命运的苦难一斑……本片根据刘震云的小说《温故一九四二》改编。", // 剧情简介
    },
  },
  {
    name: "活着", // 片名
    source:
      "https://vip.lzcdn2.com/20220407/2614_9730c040/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/活着.jpeg", // 封面
    score: "93", // 评分
    details: {
      alias: ["人生", "Lifetimes", "To Live"], // 别名
      directors: ["张艺谋"], // 导演
      scriptwriter: ["芦苇", "余华"], // 编剧
      actors: [
        "葛优",
        "巩俐",
        "姜武",
        "牛犇",
        "郭涛",
        "张璐",
        "倪大红",
        "肖聪",
        "董飞",
        "刘天池",
        "董立范",
        "黄宗洛",
        "刘燕瑾",
        "李连义",
        "杨同顺",
      ], // 演员
      types: ["剧情", "家庭", "历史"], // 类型
      region: "中国大陆 / 中国香港", // 地区
      language: ["汉语普通话"], // 语言
      date: "1994-06-30", // 上映日期
      duration: "132分钟", // 片长
      IMDB: "tt0110081", // 编号
      intro:
        "根据余华同名小说改编。富少福贵（葛优）嗜赌成性，妻子家珍（巩俐）屡劝无果后带着女儿凤霞离开了他，当夜，福贵输光所有家产气死父亲，被迫靠变卖母亲首饰租间破屋过活。一年后，家珍手拉凤霞怀抱刚出世的儿子有庆回到家中，福贵痛改前非，开始靠演皮影戏过起安份守己的日子。但好景不常，内战时期，福贵被国民党抓去当劳工，一番辗转终回到家乡与一家人团圆后，凤霞因病变成哑巴，而在后来的大跃进运动和文化大革命中，他虽获某些小福，逆境却也一直与他如影相随。", // 剧情简介
    },
  },
  {
    name: "盗梦空间", // 片名
    source: "https://vip.lzcdn2.com/20220318/5_1dddc8ed/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/盗梦空间.jpeg", // 封面
    score: "94", // 评分
    details: {
      alias: [
        "潜行凶间(港)",
        "全面启动(台)",
        "奠基",
        "心灵犯案",
        "记忆迷阵",
        "记忆魔方",
      ], // 别名
      directors: ["克里斯托弗·诺兰"], // 导演
      scriptwriter: ["克里斯托弗·诺兰"], // 编剧
      actors: [
        "莱昂纳多·迪卡普里奥",
        "约瑟夫·高登-莱维特",
        "艾利奥特·佩吉",
        "汤姆·哈迪",
        "渡边谦",
        "迪利普·劳",
        "基里安·墨菲",
        "汤姆·贝伦杰",
        "玛丽昂·歌迪亚",
        "皮特·波斯尔思韦特",
        "迈克尔·凯恩",
        "卢卡斯·哈斯",
        "李太力",
        "克莱尔·吉尔蕾",
        "马格努斯·诺兰",
        "泰勒·吉蕾",
        "乔纳森·吉尔",
        "水源士郎",
        "冈本玉二",
        "厄尔·卡梅伦",
        "瑞恩·海沃德",
        "米兰达·诺兰",
        "拉什·费加",
        "蒂姆·科勒赫",
        "妲露拉·莱莉",
      ], // 演员
      types: ["剧情", "科幻", "悬疑", "冒险"], // 类型
      region: "美国 / 英国", // 地区
      language: ["英语", "日语", "法语"], // 语言
      date: "2010-09-01", // 上映日期
      duration: "148分钟", // 片长
      IMDB: "tt1375666", // 编号
      intro:
        "道姆·柯布（莱昂纳多·迪卡普里奥 Leonardo DiCaprio 饰）与同事阿瑟（约瑟夫·戈登-莱维特 Joseph Gordon-Levitt 饰）和纳什（卢卡斯·哈斯 Lukas Haas 饰）在一次针对日本能源大亨齐藤（渡边谦 饰）的盗梦行动中失败，反被齐藤利用。齐藤威逼利诱因遭通缉而流亡海外的柯布帮他拆分他竞争对手的公司，采取极端措施在其唯一继承人罗伯特·费希尔（希里安·墨菲 Cillian Murphy 饰）的深层潜意识中种下放弃家族公司、自立门户的想法。为了重返美国，柯布偷偷求助于岳父迈尔斯（迈克尔·凯恩 Michael Caine 饰），吸收了年轻的梦境设计师艾里阿德妮（艾伦·佩吉 Ellen Page 饰）、梦境演员艾姆斯（汤姆·哈迪 Tom Hardy 饰）和药剂师约瑟夫（迪利普·劳 Dileep Rao 饰）加入行动。在一层层递进的梦境中，柯布不仅要对付费希尔潜意识的本能反抗，还必须直面已逝妻子梅尔（玛丽昂·歌迪亚 Marion Cotillard 饰）的处处破坏，实际情况远比预想危险得多……", // 剧情简介
    },
  },
  {
    name: "城南旧事", // 片名
    source:
      "https://vip.lz-cdn10.com/20220902/2376_c532cfb6/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/城南旧事.jpeg", // 封面
    score: "91", // 评分
    details: {
      alias: ["My Memories of Old Beijing", "South of the old"], // 别名
      directors: ["吴贻弓"], // 导演
      scriptwriter: ["伊明", "林海音"], // 编剧
      actors: ["沈洁", "张丰毅", "张闽", "郑振瑶", "严翔"], // 演员
      types: ["剧情"], // 类型
      region: "中国大陆", // 地区
      language: ["汉语普通话"], // 语言
      date: "1983", // 上映日期
      duration: "88分钟", // 片长
      IMDB: "tt0085326", // 编号
      intro:
        "本片根据林海音的同名短篇小说改编。小女孩林英子（沈洁 饰）住在五十年前的北京南城，在他们家院子附近住着一个疯女人秀珍（张闽 饰），秀珍的丈夫因参与学生运动被杀，孩子也不知所踪，因此落下了疯病，时常把英子当做自己的孩子“小桂子”看待，英子也喜欢秀珍，答应帮她找回小桂子。英子有个苦命的小伙伴妞儿，学戏时常遭干爹打骂，英子偶然发现妞儿有小桂子的胎记，帮助她们母女相认。英子上小学后，一家人搬到了厂甸。在家门口荒废的院落里，英子发现了一个小偷（张丰毅 饰）藏赃的草堆，小偷为了供弟弟读书只得干不光彩的勾当，英子却不把他看作是坏人。不久，女佣苏妈返乡，父亲去世，英子的童年，彷佛一下结束了……", // 剧情简介
    },
  },
  {
    name: "天空之城", // 片名
    source: "https://vip.lzcdn2.com/20220323/322_d924eacf/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/天空之城.jpeg", // 封面
    score: "92", // 评分
    details: {
      alias: [
        "天空之城拉普他",
        "空中城堡拉普他",
        "Tenkû no shiro Rapyuta",
        "Laputa: Castle in the Sky",
      ], // 别名
      directors: ["宫崎骏"], // 导演
      scriptwriter: ["宫崎骏"], // 编剧
      actors: [
        "田中真弓",
        "横泽启子",
        "初井言荣",
        "寺田农",
        "常田富士男",
        "永井一郎",
        "糸博",
        "鹫尾真知子",
        "神山卓三",
        "安原义人",
        "槐柳二",
        "鳕子",
      ], // 演员
      types: ["动画", "奇幻", "冒险"], // 类型
      region: "日本", // 地区
      language: ["日语"], // 语言
      date: "1992-05-01", // 上映日期
      duration: "125分钟", // 片长
      IMDB: "tt0092067", // 编号
      intro:
        "古老帝国拉比达是一座漂浮在空中的巨大的机器岛，传说那里已经无人居住，蕴藏着巨大的财富。因此，无论军方还是海盗，都在找寻着这座传说中的飞行岛。矿工帕克这天偶遇拉比达继承人希达，两人一见如故。因为希达身上有找寻拉比达帝国的重要物件飞行石，军方和海盗两帮人马都在追杀希达。帕克带着希达一起逃亡，最终都没有逃出军方的手中，希达被军队掳走了。为救朋友，帕克只能选择与海盗合作。帕克与海盗成功救出了希达，同时，他们也发现了军方的邪恶计划。为了阻止军方邪恶计划的实施，他们和海盗一起踏上了寻找拉比达之旅。", // 剧情简介
    },
  },
  {
    name: "楚门的世界", // 片名
    source: "https://cdn.zoubuting.com/20220524/7eG65lXt/1000kb/hls/index.m3u8", // 播放源
    cover: "/covers/楚门的世界.jpeg", // 封面
    score: "94", // 评分
    details: {
      alias: ["真人Show(港)", "真人戏", "真人世界", "楚门秀", "真人秀"], // 别名
      directors: ["彼得·威尔"], // 导演
      scriptwriter: ["安德鲁·尼科尔"], // 编剧
      actors: [
        "金·凯瑞",
        "劳拉·琳妮",
        "艾德·哈里斯",
        "诺亚·艾默里奇",
        "娜塔莎·麦克艾霍恩",
      ], // 演员
      types: ["剧情", "科幻"], // 类型
      region: "美国", // 地区
      language: ["英语"], // 语言
      date: "1998-06-05", // 上映日期
      duration: "103分钟", // 片长
      IMDB: "tt0120382", // 编号
      intro:
        "楚门（金•凯瑞 Jim Carrey 饰）是一个平凡得不能再平凡的人，除了一些有些稀奇的经历之外——初恋女友突然失踪、溺水身亡的父亲忽然似乎又出现在眼前，他和绝大多数30多岁的美国男人绝无异样。这令他倍感失落。他也曾试过离开自己生活了多年的地方，但总因种种理由而不能成行。直到有一天，他忽然发觉自己似乎一直在被人跟踪，无论他走到哪里，干什么事情。这种感觉愈来愈强烈。楚门决定不惜一切代价逃离这个他生活了30多年的地方，去寻找他的初恋女友。但他却发现自己怎样也逃不出去。真相其实很残忍。", // 剧情简介
    },
  },
  {
    name: "肖申克的救赎", // 片名
    source: "https://vip.lzcdn2.com/20220318/7_a4fcd924/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/肖申克的救赎.jpeg", // 封面
    score: "97", // 评分
    details: {
      alias: "月黑高飞(港) / 刺激1995(台) / 地狱诺言 / 铁窗岁月 / 消香克的救赎", // 别名
      directors: ["弗兰克·德拉邦特"], // 导演
      scriptwriter: "弗兰克·德拉邦特 / 斯蒂芬·金", // 编剧
      actors:
        "蒂姆·罗宾斯 / 摩根·弗里曼 / 鲍勃·冈顿 / 威廉姆·赛德勒 / 克兰西·布朗 / 吉尔·贝罗斯 / 马克·罗斯顿 / 詹姆斯·惠特摩 / 杰弗里·德曼 / 拉里·布兰登伯格 / 尼尔·吉恩托利 / 布赖恩·利比 / 大卫·普罗瓦尔 / 约瑟夫·劳格诺 / 祖德·塞克利拉 / 保罗·麦克兰尼 / 芮妮·布莱恩 / 阿方索·弗里曼 / V·J·福斯特 / 弗兰克·梅德拉诺 / 马克·迈尔斯 / 尼尔·萨默斯 / 耐德·巴拉米 / 布赖恩·戴拉特 / 唐·麦克马纳斯", // 演员
      types: "剧情 / 犯罪", // 类型
      region: "美国", // 地区
      language: ["英语"], // 语言
      date: "1994-09-10(多伦多电影节) / 1994-10-14(美国)", // 上映日期
      duration: "142分钟", // 片长
      IMDB: "tt0120382", // 编号
      intro:
        "一场谋杀案使银行家安迪（蒂姆•罗宾斯 Tim Robbins 饰）蒙冤入狱，谋杀妻子及其情人的指控将囚禁他终生。在肖申克监狱的首次现身就让监狱“大哥”瑞德（摩根•弗里曼 Morgan Freeman 饰）对他另眼相看。瑞德帮助他搞到一把石锤和一幅女明星海报，两人渐成患难 之交。很快，安迪在监狱里大显其才，担当监狱图书管理员，并利用自己的金融知识帮助监狱官避税，引起了典狱长的注意，被招致麾下帮助典狱长洗黑钱。偶然一次，他得知一名新入狱的小偷能够作证帮他洗脱谋杀罪。燃起一丝希望的安迪找到了典狱长，希望他能帮自己翻案。阴险伪善的狱长假装答应安迪，背后却派人杀死小偷，让他唯一能合法出狱的希望泯灭。沮丧的安迪并没有绝望，在一个电闪雷鸣的风雨夜，一场暗藏几十年的越狱计划让他自我救赎，重获自由！老朋友瑞德在他的鼓舞和帮助下，也勇敢地奔向自由。本片获得1995年奥斯卡10项提名，以及金球奖、土星奖等多项提名。", // 剧情简介
    },
  },
  {
    name: "黑客帝国1", // 片名
    source: "https://vip.lzcdn2.com/20220321/184_c1e1ee38/1200k/hls/mixed.m3u8", // 播放源
    cover: "/covers/黑客帝国.jpeg", // 封面
    score: "91", // 评分
    details: {
      alias:
        "22世纪杀人网络(港) / 廿二世纪杀人网络(港) / 骇客任务(台) / 骇客帝国", // 别名
      directors: "莉莉·沃卓斯基 / 拉娜·沃卓斯基", // 导演
      scriptwriter: "莉莉·沃卓斯基 / 拉娜·沃卓斯基", // 编剧
      actors:
        "基努·里维斯 / 劳伦斯·菲什伯恩 / 凯瑞-安·莫斯 / 雨果·维文 / 格洛丽亚·福斯特 / 乔·潘托里亚诺 / 马库斯·钟 / 朱利安·阿拉汗加 / 马特·多兰 / 贝琳达·麦克洛里 / 安东尼雷派克 / 罗伯特·泰勒 / 阿达·尼科德莫 / 罗温·维特 / 塔玛拉·布朗 / 纳塔莉·特珍 / 比尔·扬 / 克里斯·斯科特 / 纳许·埃哲顿", // 演员
      types: "动作 / 科幻", // 类型
      region: "美国", // 地区
      language: ["英语"], // 语言
      date: "2000-01-14(中国大陆) / 1999-03-31(美国)", // 上映日期
      duration: "136分钟", // 片长
      IMDB: "tt0133093", // 编号
      intro:
        "一场谋杀案使银行家安迪（蒂姆•罗宾斯 Tim Robbins 饰）蒙冤入狱，谋杀妻子及其情人的指控将囚禁他终生。在肖申克监狱的首次现身就让监狱“大哥”瑞德（摩根•弗里曼 Morgan Freeman 饰）对他另眼相看。瑞德帮助他搞到一把石锤和一幅女明星海报，两人渐成患难 之交。很快，安迪在监狱里大显其才，担当监狱图书管理员，并利用自己的金融知识帮助监狱官避税，引起了典狱长的注意，被招致麾下帮助典狱长洗黑钱。偶然一次，他得知一名新入狱的小偷能够作证帮他洗脱谋杀罪。燃起一丝希望的安迪找到了典狱长，希望他能帮自己翻案。阴险伪善的狱长假装答应安迪，背后却派人杀死小偷，让他唯一能合法出狱的希望泯灭。沮丧的安迪并没有绝望，在一个电闪雷鸣的风雨夜，一场暗藏几十年的越狱计划让他自我救赎，重获自由！老朋友瑞德在他的鼓舞和帮助下，也勇敢地奔向自由。本片获得1995年奥斯卡10项提名，以及金球奖、土星奖等多项提名。", // 剧情简介
    },
  },
];

export const book = [
  {
    name: "尼安德特人", // 书名
    source: "/books/尼安德特人 (斯万特·帕博) (Z-Library).epub", // 资源地址
    cover: "/covers/尼安德特人.jpg", // 封面
    score: "83", // 评分
    details: {
      author: ["[瑞典] 斯万特·帕博（Svante Pääbo）"], // 作者
      producer: ["后浪"], // 出品方
      publisher: "浙江教育出版社", // 出版社
      translator: "夏志 / 杨焕明", // 译者
      subTitle: "", // 副标题
      date: "2018-12", // 出版日期
      pageNumber: 336, // 页数
      price: "68.00元", // 定价
      binding: "精装", // 装帧
      series: "", // 丛书
      ISBN: "9787553678351", // 编号
    },
  },
  {
    name: "哲学的故事", // 书名
    source:
      "/books/哲学的故事【让深奥的哲学立刻生动起来上市首年连续再版22次，迅速译成18种语言，掀起全球哲学热潮】 (威尔•杜兰特 (Will Durant)) (Z-Library).epub", // 资源地址
    cover: "/covers/哲学的故事.jpg", // 封面
    score: "88", // 评分
    details: {
      author: ["[美] 威尔·杜兰特"], // 作者
      publisher: "新星出版社", // 出版社
      producer: ["新经典文化"], // 出品方
      translator: "蒋剑峰 / 张程程", // 译者
      subTitle: "", // 副标题
      date: "2013-3", // 出版日期
      pageNumber: 432, // 页数
      price: "49.00元", // 定价
      binding: "平装", // 装帧
      series: "", // 丛书
      ISBN: "9787513306331", // 编号
      originalTitle: "The Story of Philosophy",
    },
  },
  {
    name: "写作是门手艺", // 书名
    source:
      "/books/The Craft of Writing 写作是门手艺 (刘军强) (Z-Library).epub", // 资源地址
    cover: "/covers/写作是门手艺.jpg", // 封面
    score: "91", // 评分
    details: {
      author: ["刘军强"], // 作者
      publisher: "广西师范大学出版社", // 出版社
      producer: [], // 出品方
      translator: "", // 译者
      subTitle: "", // 副标题
      date: "2020-7-30", // 出版日期
      pageNumber: 316, // 页数
      price: "58.00元", // 定价
      binding: "平装", // 装帧
      series: "", // 丛书
      ISBN: "9787559830043", // 编号
    },
  },
  {
    name: "And Then There Were None", // 书名
    source:
      "/books/And Then There Were None (Agatha Christie) (Z-Library).epub", // 资源地址
    cover: "/covers/无人生还.jpg", // 封面
    score: "100", // 评分
    details: {
      author: ["Agatha Christie"], // 作者
      publisher: "William Morrow Paperbacks", // 出版社
      producer: [], // 出品方
      translator: "", // 译者
      subTitle: "", // 副标题
      date: "2011", // 出版日期
      pageNumber: 272, // 页数
      price: "", // 定价
      binding: "", // 装帧
      series: "", // 丛书
      ISBN: "9780062073471", // 编号
    },
  },
];

export const music = [
  {
    name: "", // 歌名
    source: "", // 播放源
    lyrics: "", // 歌词
    cover: "", // 封面
    score: "", // 评分
    details: {
      singer: [], // 歌手
      date: "", // 日期
    },
  },
];

export const image = [
  {
    name: "", // 图片名
    source: "", // 资源地址
    score: "", // 评分
    details: {
      author: [], // 作者
      date: "", // 日期
    },
  },
];
